
using System;
using System.Collections.Specialized;
using System.Diagnostics;
using System.Runtime.InteropServices;
using System.Web.UI;
using static KC__LID_EXT.BackEnd.Dump.SDK.UBrgUIManager;

/// <summary>
///  Last Game Update (SteamDB Link Below) | Date: 25 July 2024 | Build: 15046130
///  https://steamdb.info/app/794600/patchnotes/
/// </summary>
namespace KC__LID_EXT.BackEnd.Dump
{
    internal class SDK
    {
        public  class Base
        { 
            //------------------------------------------------------------------------------
            public const string ProcName = "BrgGame-Steam.exe";
            //------------------------------------------------------------------------------
            public const string ModuleBase = "BrgGame-Steam.exe+";
            //------------------------------------------------------------------------------
        }
        public class Offsets : Base
        {
            // Inheritance: Base
            // CUSTOM BASE - USING! LAST UPDATED 3/30/23
            //------------------------------------------------------------------------------
            public const string GUBrgUIManager = ModuleBase + "0x0F242EE0,"; // UPDATE ME IF TRAINER BREAKS!!!!!
            // CHEAT ENGINE AOB "86 64 7C 00 00 48 8B 88" - search me to get new base offset!
            //------------------------------------------------------------------------------
        }

                public const string mShishimaiDrainRateMax = mPlayerCommonPawn + "0x5604"; // float
                public const string mWeaponDrainRate = mPlayerCommonPawn + "0x5608"; // float
                public const string mWeaponDrainRateMax = mPlayerCommonPawn + "0x560c"; // float
                public const string mTaserGunChargeAtkUpRate = mPlayerCommonPawn + "0x5610"; // float
                public const string mBlackThunderSwordSkillMoveInterval = mPlayerCommonPawn + "0x5614"; // float
                public const string mBlackThunderSwordSkillMoveRange = mPlayerCommonPawn + "0x5618"; // float
                public const string mBlackThunderMedusaSkillMoveInterval = mPlayerCommonPawn + "0x561c"; // float
                public const string mBlackThunderMedusaSkillMoveRange = mPlayerCommonPawn + "0x5620"; // float
                public const string mBlackThunderMedusaSkillMoveHpRate = mPlayerCommonPawn + "0x5624"; // float
                public const string mBlackThunderMedusaSkillMoveDrainRate = mPlayerCommonPawn + "0x5628"; // float
                public const string mBlackThunderAdjustDurabilityDown = mPlayerCommonPawn + "0x562c"; // float
                public const string mPaleWindAdjustArmorDurabilityDown = mPlayerCommonPawn + "0x5630"; // float
                public const string mPaleWindAdjustWeaponDurabilityDown = mPlayerCommonPawn + "0x5634"; // float
                public const string mPaleWindBobsledMasterLvlAtkUpRate = mPlayerCommonPawn + "0x5638"; // float
                public const string mBodySkillStickerObject = mPlayerCommonPawn + "0x563c,"; // UBrgBodySkillStickerObject*
                public const string __CallBackSlowMotionEnd__Delegate = mPlayerCommonPawn + "0x5644,"; // DelegateProperty
            }
        }
    }

    internal class LetItDie
    {
        private bool bAttached = false;
        private string procName = "BrgGame-Steam";
        public static MemorySharp.Memory mem = new MemorySharp.Memory();

        public LetItDie() 
        { 
            bAttached = mem.Attach(procName, MemorySharp.Memory.ProcessAccessFlags.All); 
        }

        public void Update()
        {
            if (Process.GetProcessesByName(procName).Length <= 0 && bAttached)
            {
                bAttached = false;
                mem.Detach();
            }
        }

        struct offsets
        {
            public const int oGWorld = 0x022B9D40;
            public const int oGUBrgUIManager = 0x0F242EE0;
        }

        public struct TArray
        {
            IntPtr m_data;
            Int32 m_count;
            Int32 m_max;

            public Int32 Count() { return m_count; }
            public Int32 Max() { return m_max; }
            public IntPtr Data() { return m_data; }
        }

        public struct FVector
        {
            public float x, y, z;
        }

        public struct FRotator
        {
            public float Pitch, Yaw, Roll;
        }


        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        struct AActor
        {
            [FieldOffset(0x80)]
            public FVector location;


            [FieldOffset(0x8C)]
            public FRotator rotation;
        }

        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        struct APawn
        {
            [FieldOffset(0x02A0)]
            IntPtr Controller;  //0x02A0    //  AController*

            [FieldOffset(0x04A8)]
            IntPtr Mesh;	//0x04A8    //  USkeletalMeshComponent* 
        }

        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        struct ABrgCommonPawn_CustomCharaNative
        {
            //  [FieldOffset(0x0590)]
            //  FBrgLocalItemInfo[] mEquipPartInfo[8];    //0x0590

            //  [FieldOffset(0x02A0)]
            //  TArray mDeathBag;   //0x3E58

            [FieldOffset(0x43E8)]
            IntPtr mArmWeaponL;   //0x43E8    //  ABrgWeapon_Base*

            [FieldOffset(0x43F0)]
            IntPtr mArmWeaponR;   //0x43F0    //  ABrgWeapon_Base*

            //  [FieldOffset(0x43F8)]
            //  FBrgCharaStatisticsData N00002799;  //0x43F8

            [FieldOffset(0x4C44)]
            float mWeaponLAtkScale; //0x4C44

            [FieldOffset(0x4C48)]
            float mWeaponRAtkScale;	//0x4C48

        }

        struct ABrgCommonPawn_CustomChara 
        {

        }

        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        struct UBrgUIManagerBase
        {
            [FieldOffset(0x009C)]
            IntPtr mGameInfoNativeBase;	//0x009C    //  ABrgGameInfoNativeBase*

        }

        [StructLayout(LayoutKind.Explicit, Pack = 1)]
        struct UBrgUIManager
        {
            [FieldOffset(0x27EC)]
            public IntPtr mGameInfoNative;    //0x27EC //  ABrgGameInfoNative*

            [FieldOffset(0x009C)]
            public IntPtr mCamera;    //0x280C //  ABrgCamera*

            [FieldOffset(0x2850)]
            public IntPtr mDropItemManager;  //0x2850    //  UBrgDropItemManager*

            [FieldOffset(0x2D1C)]
            public IntPtr mPawnPlayerBase;   //0x2D1C    //  ABrgPawn_PlayerBase*

            [FieldOffset(0x2D34)]
            public IntPtr mPlayerCommonPawn;	//0x2D34    //  ABrgCommonPawn_CustomChara*
        }

        public IntPtr GetUIManager() { return mem.Read<IntPtr>(mem.dwBase + offsets.oGUBrgUIManager); }

        public IntPtr GetGameInfo()
        {
            var pUIMan = GetUIManager();
            if (pUIMan == IntPtr.Zero)
                return IntPtr.Zero;

            return mem.Read<IntPtr>(pUIMan + 0x27EC);  //  mGameInfoNative
        }

        public IntPtr GetLocalPawn()
        {
            var pUIMan = GetUIManager();
            if (pUIMan == IntPtr.Zero)
                return IntPtr.Zero;

            var pUIMan2 = mem.Read<UBrgUIManager>(pUIMan);
            return pUIMan2.mPlayerCommonPawn;
        }

        public bool GetLocalPawnDeathbag(out IntPtr[] items)
        {
            items = null;

            var pLocalPawn = GetLocalPawn();
            if (pLocalPawn == IntPtr.Zero)
                return false;

